PRIVILEGIZÁLT JELSZÓ
Mindkét forgalomirányítón állítson be enable és enable secret jelszót!
R1(config)#enable password cisco
R1(config)#enable secret class
R1(config)#service password-encryption
R1(config)#exit

CONZOL JELSZÓ
line console 0
password cisco
login
logging synchronous
exit

VONALI JELSZÓ
line vty 0 15
password cisco
login
exit

TITKOSÍTÁS
service password-encryption
exit

KONFIGURÁCIÓ MENTÉSE
copy running-config startup-config

DNS KIKAPCS
no ip domain-lookup

FELHASZNÁLÓI NÉVVEL VALÓ BELÉPÉS (aki 15-ös szinten van, enable jelszó
nélkül is erre a szintre kerül):
(config)# username admin privilege 15 secret cisco
(config)#line vty 0 15
(config-line)#privilege level 15
(config-line)#login local
	
TELNET
line vty 0 15
transport input telnet
password cisco
login
exit

BANNER
R1(config)#banner motd #Jogosulatlan használat tilos!#

DESCRIPTION PÉLDA
R1(config-if)#description.......................

SWITCH IP BEÁLLÍTÁSA
interface vlan 1
ip address 192.168.1.254 255.255.255.0
no shutdown

ALAPÉRTELMEZETT ÁTJÁRÓ BEÁLLÍTÁSA
ip default-gateway 172.17.99.1
end


interface serial 0/0
# configure terminal
(config)# interface ethernet 1/1
(config-if)# description "10G Server Link"

SSH TANKÖNYV:
s1# configure terminal
s1(config)#ip domain-name cisco.com
crypto key generate rsa
1024
username admin secret ccna
line vty 0 15
transport input ssh
login local
exit
ip ssh version 2
ip ssh auth 2
ip ssh time 60
exit



r1(config)#int serial 0/0/0 
r1(config-if)#ip address 192.168.7.1 255.255.255.0
r1(config-if)#no sh

SWITCH IP CÍM
configure terminal
interface vlan 1
ip address 192.168.10.2 255.255.255.0
no shutdown


VLAN TARTOMÁNY MEGADÁSA
S1(config)#vlan 10
S1(config-vlan)#name tanulok
S1(config-vlan)#int range f0/1-2
S1(config-if-range)#switchport mode access
S1(config-if-range)#switchport access vlan 10
S1(config-if-range)#exit
S1(config)#

TRUNK, NATIVE VLAN:

int range f0/1-4
switchport mode trunk
switchport trunk native vlan 99

VLAN
Switch>enable 
---
Switch#vlan database  
Switch(vlan)#vlan 10 name A
Switch(vlan)#vlan 20 name B
### ha rossz a név:
Switch(vlan)#vlan 300 name C
VLAN 300 added:
    Name: C
Switch(vlan)#vlan 300 name D
VLAN 300 modified:
    Name: D
Switch(vlan)#
###
### ha elrontottad a vlan id:
Switch(vlan)#no vlan 300
Deleting VLAN 300...
###
Switch(vlan)#exit
---

PORT BEÁLLÍTÁS:

interface fa0/2
switchport mode access
switchport access vlan 10
switchport access vlan 20


LOOPBACK ENGEDÉLYEZÉSE
interface loopback 0
ip address 10.10.10.1
exit

show ip interface brief
 - Valamennyi interfészt magába foglaló összegzést
 jelenít meg az interfészek IPv4-címeivel és az aktuális
állapotukkal.

KÖVETKEZÕ UGRÁS
ip route hálózati-cím alhálózati-maszk {IP-cím | kimenõ-interfész}.

TELJECEN MEGHATÁROZOTT ÚTVONAL
R1(config)# ip route 192.168.2.0 255.255.255.0 GigabitEthernet 0/1


DOT1Q
Admin(config)#int gig0/0.30
Admin(config-subif)#encapsulation dot1Q 30
Admin(config-subif)#ip address 10.10.10.193 255.255.255.192
Admin(config-subif)#no sh

This example shows how to set VLAN 3 as the native trunk port:

switch# configure terminal
switch(config)# interface vethernet 1
switch(config-if)# switchport trunk native vlan 3
switch(config-if)#

VTP BEÁLLÍTÁS SERVER:

Switch>ena
Switch#conf t
Switch(config)#vtp mode server 
Device mode already VTP SERVER.
Switch(config)#vtp domain test
Changing VTP domain name from NULL to test
Switch(config)#vtp password titok
Setting device VLAN database password to titok
Switch(config)#vtp version 2

VTP BEÁLLÍTÁS CLIENT:

Switch>ena
Switch#conf t
Switch(config)#vtp mode client 
Device mode already VTP CLIENT.
Switch(config)#vtp domain test
Changing VTP domain name from NULL to test
Switch(config)#vtp password titok
Setting device VLAN database password to titok
Switch(config)#vtp version 2

!!! A VTP a leg nagyobb Revision verziórol másol.!!!!!
Switch#sh vtp status 
VTP Version                     : 2
Configuration Revision          : 1
Maximum VLANs supported locally : 255
Number of existing VLANs        : 5
VTP Operating Mode              : Server
VTP Domain Name                 : test
VTP Pruning Mode                : Disabled
VTP V2 Mode                     : Enabled
VTP Traps Generation            : Disabled
MD5 digest                      : 0x28 0x3F 0xDE 0x87 0xE1 0x74 0xE0 0x95 
Configuration last modified by 0.0.0.0 at 3-1-93 00:02:16
Local updater ID is 0.0.0.0 (no valid interface found)
Switch#

DHCP
----
R2(config)#int gigabitEthernet 0/1
R2(config-if)#ip address 192.168.201.1 255.255.255.0
R2(config-if)#no sh
R2(config-if)#exit
R2(config)#ip dhcp excluded-address 192.168.201.1
R2(config)#ip dhcp excluded-address 192.168.201.2 192.168.200.10
ex

R2(config)#ip dhcp pool LAN1
R2(dhcp-config)#network 192.168.201.0 255.255.255.0
R2(dhcp-config)#default-router 192.168.201.1
R2(dhcp-config)#dns-server 192.168.200.253
R2(dhcp-config)#exit
R2(config)#

DHCP Helper
config#interface gig0/0/0
config-if#ip helper-address 10.0.0.1

MENTÉS FTP SERVERRE: (!!!!!! IP)
Switch#copy running-config tftp
Address or name of remote host []? 192.168.0.254
Destination filename [Switch-confg]? SW1.config

Writing running-config...!!
[OK - 1091 bytes]

1091 bytes copied in 0.033 secs (33060 bytes/sec)


PORT SECURITY

Switch(config)#int fa0/1

Switch(config-if)#switchport mode access 
Switch(config-if)#switchport port-security 
Switch(config-if)#switchport port-security mac-address sticky 
Switch(config-if)#switchport port-security violation shutdown 
Switch(config-if)#no shutdown
do w


NAT

Statikus NAT:

conf t
int g0/0
ip nat inside ---------- a belsõ hálózat interfésze
exit
int g0/1
ip nat outside ----------------- a külsõ hálózat interfésze
exit
ip nat inside source static x.x.x.x x.x.x.x ---- az elsõ ip amit le szeretnénk fordítani akülsõ ip címre
az a második ip cím, ez a második cím látszik majd kívülrõl

Dinamukus NAT:

1. pool létrehozása

conf t
ip nat pool NÉV CÍMTARTOMÁNY netmask 255.255.255.0
ip nat pool natLAN 209.100.100.2 ---ez az elsõ amit kinatolunk 209.100.100.10 --- ez az utolsó amit kinatolunk netmask 255.255.255.0

2. acl listát hozunk létre kijelöljük a belsõ hálózatunkat a teljeset

access-list 1 permit 192.168.10. 0.0.0.255

3. az acl és a nat összerendezése

ip nat inside source list 1 pool natLAN

4. ellenõrzés 

#sh ip nat translations


Passiv FTP engedélyezése:
R1(config)#int g0/0
R1(config-if)#ip access-group 100 in
R1(config-if)#exit
R1(config)#access-list 100 permit tcp any host 2.2.2.2 eq ftp
R1(config)#access-list 100 permit tcp any host 2.2.2.2 gt 1024

R1(config)#int g0/1
R1(config-if)#ip access-group 101 in
R1(config-if)#exit
R1(config)#access-list 101 permit tcp host 2.2.2.2 eq ftp any established
R1(config)#access-list 101 permit tcp host 2.2.2.2 gt 1024 any established

aktive ftp engedélyezése
R1(config)#int g0/0
R1(config-if)#ip access-group 100 in
R1(config-if)#exit
R1(config)#access-list 100 permit tcp any host 2.2.2.2 eq ftp
R1(config)#access-list 100 permit tcp any host 2.2.2.2 eq 20 established

R1(config)#int g0/1
R1(config-if)#ip access-group 101 in
R1(config)#exit
R1(config)#access-list 101 permit host 2.2.2.2 eq ftp any established
R1(config)#access-list 101 permit host 2.2.2.2 eq 20 any

aktive ftp engedélyezése
R1(config)#int g0/0
R1(config-if)#ip access-group 100 in
R1(config-if)#exit
R1(config)#access-list 100 permit tcp any host 2.2.2.2 eq ftp
R1(config)#access-list 100 permit tcp any host 2.2.2.2 eq 20 established

R1(config)#int g0/1
R1(config-if)#ip access-group 101 in
R1(config)#exit
R1(config)#access-list 101 permit host 2.2.2.2 eq ftp any established
R1(config)#access-list 101 permit host 2.2.2.2 eq 20 any

icmp engedélyezése:
R1(config)#int g0/0
R1(config-if)#ip access-group 100 in
R1(config-if)#exit
R1(config)#access-list 100 permit icmp any any echo

R1(config)#int g0/1
R1(config-if)#ip access-group 101 in
R1(config-if)#exit
R1(config)#access-list 101 permit icmp any any echo-reply

Több szolgáltatás engedélyezése a belsõ hálózatból:
R1(config)#int g0/0
R1(config-if)#ip access-group 100 in
R1(config-if)#exit
R1(config)#access-list 100 permit tcp any any eq www
R1(config)#access-list 100 permit tcp any any eq telnet
R1(config)#access-list 100 permit tcp any any eq smtp
R1(config)#access-list 100 permit tcp any any eq pop3
R1(config)#access-list 100 permit tcp any any eq 21
R1(config)#access-list 100 permit tcp any any eq 20

ftp tiltás:
R1(config)#int g0/0
R1(config-if)#ip access-group 100 in
R1(config-if)#exit
R1(config)#access-list 100 deny tcp any any eq ftp
R1(config)#access-list 100 deny tcp any any eq ftp-data
R1(config)#access-list 100 permit ip any any

DNS engedélyezése:
R1(config)#int g0/0
R1(config-if)#ip access-group 100 in
R1(config-if)#exit
R1(config)#access-list 100 permit udp any any eq domain 
R1(config)#access-list 100 permit tcp any any eq 53

ellenörzés:
nslookup valami.hu 2.2.2.3

DNS engedélyezése:
R1(config)#int g0/0
R1(config-if)#ip access-group 100 in
R1(config-if)#exit
R1(config)#access-list 100 permit udp any any eq domain 
R1(config)#access-list 100 permit tcp any any eq 53

ellenörzés:
nslookup valami.hu 2.2.2.3

normal acl
Router>enable
Router#configure terminal 
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#access-list 1
Router(config)#access-list 1 ?
  deny    Specify packets to reject
  permit  Specify packets to forward
  remark  Access list entry comment
Router(config)#access-list 1 permit 1.1.1.11
Router(config)#interface gigabitEthernet 0/1
Router(config-if)#ip access-group 1 ?
  in   inbound packets
  out  outbound packets
Router(config-if)#ip access-group 1 in
Router(config-if)#end
sh ip access-lists 1

Rossz!!! Fontos a sorend..

R1(config)#access-list 1 permit any
R1(config)#access-list 1 deny host 1.1.1.12

R1(config)#access-list 1 permit 1.1.1.11
R1(config)#line vty 0 15
R1(config-if)#access-class 1 in
R1(config-if)#end

no access-list 1

R1(config)# access-list 1 deny 192.168.10.5 0.0.0.0
R1(config)# access-list 1 permit 192.168.10.0 0.0.0.255
R1(config)# exit
R1# 
R1# show access-lists 1
Standard IP access list TILT
    10 deny  192.168.10.5
    20 permit 192.168.10.0, wildcard bits 0.0.0.255
R1#
R1#conf t
R1(config)# ip access-list standard 1
R1(config-std-nacl)# no 10
R1(config-std-nacl)# 10 deny host 192.168.10.11
R1(config-std-nacl)# end
R1#
R1# show access-lists
Standard IP access list 1
    10 deny  192.168.10.11
    20 permit 192.1678.10.0, wildcard bits 0.0.0.255
R1#

Router>enable 
Router#configure terminal
Router(config)#router rip 
Router(config-router)#version 1
Router(config-router)#network 192.168.100.0
Router(config-router)#no network 192.168.100.0
Router(config-router)#network 192.168.0.0
Router(config-router)#network 192.168.1.0
Router(config-router)#network 10.0.0.0

Router#show ip protocols

Router#debug ip rip
RIP protocol debugging is on
Router#RIP: received v1 update from 10.0.0.1 on Serial0/0/0
      192.168.0.0 in 1 hops
      192.168.1.0 in 1 hops
RIP: sending  v1 update to 255.255.255.255 via Serial0/0/0 (10.0.0.2)
RIP: build update entries
      network 192.168.2.0 metric 1
      network 192.168.3.0 metric 1
RIP: received v1 update from 10.0.0.1 on Serial0/0/0
      192.168.0.0 in 1 hops
      192.168.1.0 in 1 hops
 
Router#no debug ip rip
RIP protocol debugging is off


Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#route rip
Router(config-router)#pass
Router(config-router)#passive-interface gi
Router(config-router)#passive-interface gigabitEthernet 0/0

RIP IPV6
Router>ena
Router#conf t
Router(config)#interface serial 0/0/0
Router(config-if)#ipv6 address 2001:B::2/64
Router(config-if)#ipv6 address fe80::1 link-local 
Router(config-if)#no sh


Router>
Router>ena
Router#conf t
Router(config)#ipv6 unicast-routing 
Router(config)#ipv6 router rip da
 
Router(config)#interface serial 0/0/0
Router(config-if)#ipv6 rip da enable 

OSPF

Router>ena
Router#conf t
Router(config)#router ospf 1
Router(config-router)#network 10.0.0.0 0.0.0.3 area 0
Router(config-router)#network 192.168.1.0 0.0.0.255 area 0
Router(config-router)#network 10.0.0.4 0.0.0.3 area 0
Router(config-router)#passive-interface gig0/1 -------- amelyik hálózatot hirdeti
Router(config-router)#int gig0/2
Router(config-router)#exit
Router(config)#exit
Router#exit

R5#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
R5(config)#interface FastEthernet0/0
R5(config-if)#ip ospf cost 100
R5(config-if)#end
R5#
%SYS-5-CONFIG_I: Configured from console by console
R5#








######################################################################################################################################################################################

A futó konfigurációt a RAM - ból az NVRAM - ba másoljuk:

router#copy running-config startup-config

Ekkor keletkezik egy startup config állomány.

TFTP szerverre is menthetõ:

router#copy tftp running-config

Letöltés TFTP szerverrõl:

router#copy flash tftp

Törlése:

router#erase nvram

Router újraindítása egy konfiguráció letöltése után:

router#reload

A router és az IOS jellemzõinek lekérdezése:

router#show version

Konfigurálás:

Router#configure ?

 ? - el Lekérdezhetjük, hogy az adott pozícióban milyen parancs adható ki

Router#configure terminal
Globális konfigurációs módba kerülünk.

Ezután névadás:

Router(config)#hostname R1

Enable jelszó ami a privilegizált exec módot védi.

R1(config)enable password JELSZÓ
vagy
R1(config)enable secret JELSZÓ  ---------- titkosítottan tárolja a jelszót

Konzolos kapcsolat jeszó beállítása:

R1(config)line console 0		a konzol azonosítója 0
R1(config-line)#password JELSZÓ		a jelszó megadása
R1(config-line)#login			ettõl fogja kérni a jelszót bejelentkezéskor

Jelszó törlése:

R1(config-line)#no password JELSZÓ	a korábbi jelszó törlése
R1(config-line)#password újJELSZÓ	az új jelszó megadása

TELNET a virtuális (vty) kapcsolat jelszó beállítása:

R1(config-line)#exit 			vissza a globális konfigurációs módba
R1(config)#line vty 0 4			egy paranccsal a router összes Telnet vonalát beállítjuk
R1(config-line)#password JELSZÓ		a jelszó megadása
R1(config-line)#login			ettõl fogja kérni a jelszót bejelentkezéskor

A konfigurációs állomány lekérdezése:

R1# show running-config


Fájlrendszerek:

router#show file system  vagy  dir file system
router#show flash
router#dir flash
router#dir nvram 				

Interfészek beállítása:

router(config)#interface MÉDIATÍPUS SLOT/PORT

router#show interface brief		paranccsal nézhetjük meg az interfészek nevét
router#show ip interface brief		az interfészek állapotát, mûködését ellenõrizzük
router#show interfaces TÍPUS SLOT/PORT	pl fa0/1



Elõsször az IP címet adjuk meg:

router(config-if)#ip address IP-CÍM NETMASZK
router(config-if)#no shutdown



DTE - az adatok forrását és célját jelentõ készülék. DCE hálózat segítségével csatlakozik. Routerek és számítógépek. Az adatokat elõállítja és egy DCE-hez továbbítja, 
lényeges vezérlõ karakterekkel. Információforrás vagy információs mosogató eszköz.

DCE - PL egy WAN-hoz kapcsolódó adatátviteli berendezés A DTE közötti interfészként használt eszköz. A jeleket az átviteli közegnek megfelelõ formátumra konvertálja, 
és bevezeti a hálózati vonalon. A kommunikációhoz a DCE eszközöket össze kell hangolni. A DCE hálózat két DTE hálózat közegeként mûködik.

Órajel beállítása:

router(config-if)#clock rate 5600

Beágyazás:

router(config-if)#encapsulation KERET-TÍPUS	kerettípusok ethernet interfészeknél: arpa, isol, snap. Soros interfészeknél frame-relay, hdlc, ppp

Statikus útvonal konfigurálása:

router(config)#ip route CÉLHÁLÓZAT NETMASZK EZEN_ÁT [ADMIN_TÁVOLSÁG]

Lebegõ statikus útvonalak tartlék útvonalak a dinamikus útvonalak mellé és ezért nagyobb adminisztratív távolságúnak definiáljuk.

router#show ip route NWCÍM		egy útvonal adminisztratív távolságának lekérdezése
router#ip route 192.168.20.0 255.255.255.0 S0/0/0 150 beállítás a kimenõ interfész alapján

: Configure HSRP on R1 and R3.
In this step, you will configure HSRP and change the default gateway address on PC-A, PC-C, S1, and S2 to
the virtual IP address for HSRP. R1 becomes the active router via configuration of the HSRP priority
command.

STP:

S1:
spanning-tree vlan 10 root primary
end
copy run s

S2:
conf t
spanning-tree vlan 20 root primary
end

S3:
conf t
spanning-tree vlan 10 root secondary
spanning-tree vlan 20 root secondary
end 
copy run start

Minden végponton ahol pc van bpguard és portfast:

s1-s3:

conf t
int range f0/1-20
spanning-tree portfast
spanning-tree bpduguard enable
end
copy run start


PVST+

S1(config)#spanning-tree mode rapid-pvst


HSRP konfigurálása

a. Configure HSRP on R1.

R1(config)# interface g0/1
R1(config-if)# standby 1 ip 192.168.1.254 --------- hsrp virtuális interfésze
R1(config-if)# standby 1 priority 150
R1(config-if)# standby 1 preempt --------------------- õ fog dolgozni

b. Configure HSRP on R3.

R3(config)# interface g0/1
R3(config-if)# standby 1 ip 192.168.1.254  --------- õ lesz a várakozó

c. Verify HSRP by issuing the show standby command on R1 and R3.
R1# show standby


HSRP kikapcsolása:

R1(config)# interface g0/1
R1(config-if)# no standby 1
R3(config)# interface g0/1
R3(config-if)# no standby 1

GLBP Config:

R1(config)# interface g0/1
R1(config-if)# glbp 1 ip 192.168.1.254
R1(config-if)# glbp 1 preempt
R1(config-if)# glbp 1 priority 150
R1(config-if)# glbp 1 load-balancing round-robin

b. Configure GLBP on R3.
R3(config)# interface g0/1
R3(config-if)# glbp 1 ip 192.168.1.254
R3(config-if)# glbp 1 load-balancing round-robin

a. Issue the show glbp brief command on R1 and R3.
R1# show glbp brief




ETHERCHANNEL

int range g0/1-2
channel-group 1 mode active
interface port-channel 1
switchport mode trunk
switchport trunk allowed vlan 1,10,20

show interface etherchannel

A módokkal